code-review/NRB_3471_3546/База_Стало/InformationRegisters/РеестрКвалифицированныхИнвесторовРОФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрКвалифицированныхИнвесторовРОФР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРеестраКвалифицированныхИнвесторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЦенныхБумагДляРеестраКвалифицированныхИнвесторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/РеестрКвалифицированныхИнвесторовРОФР/Ext/ManagerModule.bsl
Функция ЕстьКвалификацияИнвестора(ЮрФизЛицо, ВидИнструмента, Дата) Экспорт
	Признание = Новый Массив;
	Признание.Добавить(Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.Признание);
	Признание.Добавить(Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.ПодтверждениеСтатуса);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(Реестр.Период) КАК Период,
	|	Реестр.Организация КАК Организация,
	|	Реестр.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Реестр.ВидИнструмента КАК ВидИнструмента
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.РеестрКвалифицированныхИнвесторовРОФР.СрезПоследних(
	|			&Дата,
	|			ВидИнструмента = &ВидИнструмента
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Организация = &Организация) КАК Реестр
	|ГДЕ
	|	Реестр.ФлагАктивности
	|
	|СГРУППИРОВАТЬ ПО
	|	Реестр.Организация,
	|	Реестр.ЮрФизЛицо,
	|	Реестр.ВидИнструмента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрКвалифицированныхИнвесторовРОФР.ВидОперации КАК ВидОперации
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрКвалифицированныхИнвесторовРОФР КАК РеестрКвалифицированныхИнвесторовРОФР
	|		ПО вт.Организация = РеестрКвалифицированныхИнвесторовРОФР.Организация
	|			И вт.ЮрФизЛицо = РеестрКвалифицированныхИнвесторовРОФР.ЮрФизЛицо
	|			И вт.ВидИнструмента = РеестрКвалифицированныхИнвесторовРОФР.ВидИнструмента
	|			И вт.Период = РеестрКвалифицированныхИнвесторовРОФР.Период
	|			И (РеестрКвалифицированныхИнвесторовРОФР.ФлагАктивности = ИСТИНА)
	|ГДЕ
	|	РеестрКвалифицированныхИнвесторовРОФР.ВидОперации В(&Признание)");
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("ВидИнструмента",	ВидИнструмента);
	Запрос.УстановитьПараметр("Признание",		Признание);
	Запрос.УстановитьПараметр("ЮрФизЛицо",		ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация",	Константы.ОрганизацияПоУмолчанию.Получить());
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции
